Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
import matplotlib.pyplot as plt
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

Part 1: Simple Examples

1.1 Concatenate

Concatenate sticks dataframes together, either on top of each other, or next to each other.

First, let's create two dataframes, df1 and df2.

In [15]:
#create df1
df1 = pd.DataFrame({"a": [1, 2, 3, 4], "b": [4, 5, 6, 7], "c": [7, 8, 9, 10]})
df1.head()

   a  b   c
0  1  4   7
1  2  5   8
2  3  6   9
3  4  7  10

In [8]:
#create df2
df2 = pd.DataFrame({"a": [6, 7, 2, 12], "b": [3, 5, 12, 6], "c": [10, 4, 2, 7]})
df2.head()

    a   b   c
0   6   3  10
1   7   5   4
2   2  12   2
3  12   6   7

**Concatinate by Rows**

**concatinating by rows is the default behavior of pd.concat() This is often the most common form of concatination**

In [17]:
# Next, let's stick the dataframes on top of each other using `concat`.
# `axis=0` indicates a row operation. 
#Note that 'axis=0' is the default and doesn't have to be specified.
concatinated_by_row = pd.concat([df1, df2], axis=0)
concatinated_by_row = concatinated_by_row.reset_index()
concatinated_by_row

   index   a   b   c
0      0   1   4   7
1      1   2   5   8
2      2   3   6   9
3      3   4   7  10
4      0   6   3  10
5      1   7   5   4
6      2   2  12   2
7      3  12   6   7

**Concatinate by columns**

In [21]:
concatinated_by_column= pd.concat([df1, df2], axis=1)


concatinated_by_column

   a  b   c   a   b   c
0  1  4   7   6   3  10
1  2  5   8   7   5   4
2  3  6   9   2  12   2
3  4  7  10  12   6   7

In [23]:
#rename the column
concatinated_by_column.columns = ["a", "b", "c", "d", "e", "f"]
concatinated_by_column

   a  b   c   d   e   f
0  1  4   7   6   3  10
1  2  5   8   7   5   4
2  3  6   9   2  12   2
3  4  7  10  12   6   7

**1.2 Merge**

Merging joins two datasets together based on a common key

In [25]:
#stocknames
stockname = pd.DataFrame({'Symbol': ['AMZN', 'MSFT', 'FB', 'AAPL', 'GOOGL'], 
                          'Name': ['Amazon', 'Microsoft', 'Facebook', 'Apple', 'Google']})
stockname

  Symbol       Name
0   AMZN     Amazon
1   MSFT  Microsoft
2     FB   Facebook
3   AAPL      Apple
4  GOOGL     Google

In [26]:
#stockprice
openprice = pd.DataFrame({'Symbol': ['AAPL', 'MSFT', 'GOOGL', 'FB', 'AMZN'], 
                          'OpenPrice': [217.51, 96.54, 501.3, 51.45, 1703.34]})
openprice

  Symbol  OpenPrice
0   AAPL     217.51
1   MSFT      96.54
2  GOOGL     501.30
3     FB      51.45
4   AMZN    1703.34

In [31]:
# Merge these dataframes.
named_stocks = pd.merge(openprice, stockname, on="Symbol")
named_stocks

  Symbol  OpenPrice       Name
0   AAPL     217.51      Apple
1   MSFT      96.54  Microsoft
2  GOOGL     501.30     Google
3     FB      51.45   Facebook
4   AMZN    1703.34     Amazon

In [28]:
# Create a 3rd dataset of weekly highs
wkhigh = pd.DataFrame({'Symbol': ['FB', 'AMZN', 'AAPL', 'MSFT', 'NFLX'], 
                       '52wkHigh': [60.79, 2050.49, 233.47, 110.11, 303.22]})
wkhigh

  Symbol  52wkHigh
0     FB     60.79
1   AMZN   2050.49
2   AAPL    233.47
3   MSFT    110.11
4   NFLX    303.22

The 'on' parameter indicates a specific column that is contained in both dataframes. We use it to look up and copy information from the two df's into a combined df.

In [30]:
# Now merge that with the named stocks.
full_stocks = pd.merge(named_stocks, wkhigh, on="Symbol")
full_stocks

  Symbol  OpenPrice       Name  52wkHigh
0   AAPL     217.51      Apple    233.47
1   MSFT      96.54  Microsoft    110.11
2     FB      51.45   Facebook     60.79
3   AMZN    1703.34     Amazon   2050.49

In [32]:
  #The other paraameter is "how", by default how inner
  full_stocks = pd.merge(named_stocks, wkhigh, on="Symbol", how="inner")
full_stocks

  Symbol  OpenPrice       Name  52wkHigh
0   AAPL     217.51      Apple    233.47
1   MSFT      96.54  Microsoft    110.11
2     FB      51.45   Facebook     60.79
3   AMZN    1703.34     Amazon   2050.49

In [33]:
full_stocks = pd.merge(named_stocks, wkhigh, on="Symbol", how="left")
full_stocks

  Symbol  OpenPrice       Name  52wkHigh
0   AAPL     217.51      Apple    233.47
1   MSFT      96.54  Microsoft    110.11
2  GOOGL     501.30     Google       NaN
3     FB      51.45   Facebook     60.79
4   AMZN    1703.34     Amazon   2050.49

In [34]:
full_stocks = pd.merge(named_stocks, wkhigh, on="Symbol", how="outer")
full_stocks

  Symbol  OpenPrice       Name  52wkHigh
0   AAPL     217.51      Apple    233.47
1   MSFT      96.54  Microsoft    110.11
2  GOOGL     501.30     Google       NaN
3     FB      51.45   Facebook     60.79
4   AMZN    1703.34     Amazon   2050.49
5   NFLX        NaN        NaN    303.22

In [35]:
full_stocks = pd.merge(named_stocks, wkhigh, on="Symbol", how="right")
full_stocks

  Symbol  OpenPrice       Name  52wkHigh
0   AAPL     217.51      Apple    233.47
1   MSFT      96.54  Microsoft    110.11
2     FB      51.45   Facebook     60.79
3   AMZN    1703.34     Amazon   2050.49
4   NFLX        NaN        NaN    303.22

In [36]:
# This is code to display a `.png` inside of a jupyter notebook.
from IPython.display import display, Image
url = 'https://shanelynnwebsite-mid9n9g1q9y8tt.netdna-ssl.com/wp-content/uploads/2017/03/join-types-merge-names.jpg'
venn_diagram = Image(url=url, width=600)
display(venn_diagram)

1.3 Reshape: melt and pivot_table

Why reshape data?

Some libraries prefer data in different formats

For example, the Seaborn data visualization library prefers data in "Tidy" format often (but not always).
Seaborn will be most powerful when your datasets have a particular organization.
This format ia alternately called long-form or tidy data and is described in detail by Hadley Wickham. The rules can be simply stated:

Each variable is a column

Each observation is a row

A helpful mindset for determining whether your data are tidy is to think backwards from the plot you want to draw. From this perspective, a variable is something that will be assigned a role in the plot."

Data science is often about putting square pegs in round holes. Here's an inspiring video clip from Apollo 13: Invent a way to put a square peg in a round hole. It's a good metaphor for data wrangling!

Hadley Wickham: 'wide' format vs. 'tidy' format

In [0]:
# Let's create a simple table.

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

Table 1 provides some data about an imaginary experiment in a format commonly seen in the wild.

The table has two columns and three rows, and both rows and columns are labelled."

In [68]:
#this is the example for wide format
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [69]:
#create a column header
table1 = table1.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [0]:
#what is the unique identifier for each row
#where is the data that i want to be in my single tidy column
#MELT function helps to go from wide to tidy
tidy1 = table1.melt(id_vars="index" , value_vars=["treatmenta", "treatmentb"]

In [71]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-03-19 01:05:04--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.141.94
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.141.94|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_online_gr 100%[===================>] 196.03M  61.9MB/s    in 3.2s

2020-03-19 01:05:07 (61.9 MB/s) - instacart_online_grocery_shopping_2017_05_01.tar.gz saved [205548478/205548478]

In [72]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [73]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [74]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [75]:
products_df = pd.read_csv("products.csv")
products_df.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [76]:
orders_df = pd.read_csv("orders.csv")
orders_df.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [77]:
pro_ord_df = products_df + orders_df
pro_ord_df.head()

   aisle_id  days_since_prior_order  ...  product_name user_id
0       NaN                     NaN  ...           NaN     NaN
1       NaN                     NaN  ...           NaN     NaN
2       NaN                     NaN  ...           NaN     NaN
3       NaN                     NaN  ...           NaN     NaN
4       NaN                     NaN  ...           NaN     NaN

[5 rows x 11 columns]

In [78]:
products_df[["product_name", "order_id"]]

KeyError: ignored

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [0]:
# table2 -> tidy

In [0]:
# tidy -> table2

In [0]:
flights = sns.load_dataset('flights')

In [0]:
# Flights Pivot Table

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####